## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 54 to change, 9 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;child-adoption&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;et-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;et-response-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;hwf-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;jui-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sptribs-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;tt-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www[&#34;child-adoption&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www[&#34;et-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;adoption&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;child-adoption&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;cmc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-amend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-da&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-dn&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-pfe&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-rfe&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-response-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-staff-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-sya&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fact&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fact-admin&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;fees-register&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hwf-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hwf-staff-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ia-aip&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-user-dashboard&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-web-admin&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;lau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;manage-payments&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;nfdiv-civil-partnership&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ocmc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;paybubble&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;payment-outcome&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pcq&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;plum&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;private-law&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;probate&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;reformscan&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;return-case-doc-ccd&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sptribs-frontend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-cor&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-tribunals&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-tya&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;tt-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-approve-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-manage-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-register-org&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;xui-webapp&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;child-adoption&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;et-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;et-response-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;hwf-pet&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;jui-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;sptribs-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;tt-pet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["child-adoption"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/child-adoption"
        name                     = "child-adoption"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/MigratedSecret-child-adoption" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["et-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/et-pet"
        name                     = "et-pet"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/et-pet-secret-latest" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["et-response-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/et-response-pet"
        name                     = "et-response-pet"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/etresponsepet-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["fact-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/fact-redirect"
        name                     = "fact-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/MigratedSecret-fact-redirect" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["hwf-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/hwf-pet"
        name                     = "hwf-pet"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/hwf-pet-secret-latest" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["idam-web-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/idam-web-public"
        name                     = "idam-web-public"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["jui-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/jui-redirect"
        name                     = "jui-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sptribs-frontend"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/sptribs-frontend"
        name                     = "sptribs-frontend"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/sptribsfrontend-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["tt-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/tt-pet"
        name                     = "tt-pet"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/MigratedSecret-tt-pet" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www["child-adoption"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain_www" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/wwwchild-adoption"
        name                     = "wwwchild-adoption"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/childadoption-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www["et-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain_www" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/wwwet-pet"
        name                     = "wwwet-pet"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/etpet-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["child-adoption"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/childadoption-managed-secret" -> (known after apply)
        name                       = "childadoption-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/apply-to-adopt-a-child-placed-in-your-care-service-gov-uk/61d8b0c69e5746d98934490fe8b4562d" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/apply-to-adopt-a-child-placed-in-your-care-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk",
                  - "www.apply-to-adopt-a-child-placed-in-your-care.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["et-pet"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/etpet-managed-secret" -> (known after apply)
        name                       = "etpet-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/employmenttribunals-service-gov-uk/a266c94fa22242d08c88fa5f0f47b1fd" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/employmenttribunals-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "*.employmenttribunals.service.gov.uk",
                  - "employmenttribunals.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["et-response-pet"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/etresponsepet-managed-secret" -> (known after apply)
        name                       = "etresponsepet-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/employmenttribunals-service-gov-uk/a266c94fa22242d08c88fa5f0f47b1fd" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/employmenttribunals-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "*.employmenttribunals.service.gov.uk",
                  - "employmenttribunals.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["fact-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/factredirect-managed-secret" -> (known after apply)
        name                       = "factredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk/f433ceffeaaa4a43a89e3ec7fcae055e" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "courttribunalfinder.service.gov.uk",
                  - "www.courttribunalfinder.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["hwf-pet"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/hwfpet-managed-secret" -> (known after apply)
        name                       = "hwfpet-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/helpwithcourtfees-service-gov-uk/b09114aaab0b4383a75699ab024f95b7" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/helpwithcourtfees-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "*.helpwithcourtfees.service.gov.uk",
                  - "helpwithcourtfees.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["idam-web-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
        name                       = "idamwebpublic-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk/f4d8c10d107e40fea99bb8a0ba8088f6" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "hmcts-access.service.gov.uk",
                  - "idam-web-public.platform.hmcts.net",
                  - "idam.platform.hmcts.net",
                  - "www.idam.platform.hmcts.net",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["jui-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
        name                       = "juiredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk/cb6dd553b92140aabf2d6baadb4a3735" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "jcm.judiciary.uk",
                  - "www.jcm.judiciary.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["sptribs-frontend"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/sptribsfrontend-managed-secret" -> (known after apply)
        name                       = "sptribsfrontend-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/special-tribunals-service-gov-uk/2687963204a148db9aa2653833215e9b" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/special-tribunals-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "special-tribunals.service.gov.uk",
                  - "www.special-tribunals.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["tt-pet"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/ttpet-managed-secret" -> (known after apply)
        name                       = "ttpet-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/appeal-tax-tribunal-service-gov-uk/5152af60c0d54b34a2572b05905bcd29" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/appeal-tax-tribunal-service-gov-uk" # forces replacement
              ~ subject_alternative_names = [
                  - "*.appeal-tax-tribunal.service.gov.uk",
                  - "appeal-tax-tribunal.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.apply-for-adoption"
        name                = "_dnsauth.apply-for-adoption"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["child-adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-to-adopt-a-child-placed-in-your-care.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "6l0bcbmv2w2msgb9bhsgsz6gwpchgdhh" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["cmc"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/moneyclaims.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-amend"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.manage-application"
        name                = "_dnsauth.www.manage-application"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-da"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.decree-absolute"
        name                = "_dnsauth.www.decree-absolute"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-dn"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www.decree-nisi"
        name                = "_dnsauth.www.decree-nisi"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-rfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/respond-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "n7jggxh4nxk0bw4h7gwkkfczcgnyr8pf" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-response-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.tribunal-response"
        name                = "_dnsauth.tribunal-response"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "m1t4z891j5zxph4hm7sfz49d074mggm0" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "68ql3qng3jth214vgxkrznznlhdp4rkt" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-sya"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/claim-employment-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fact"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/find-court-tribunal.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fact-admin"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/find-court-tribunal.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["fees-register"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.fees-register"
        name                = "_dnsauth.fees-register"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hwf-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "nhxqv5qnxsf225spck3frjmmh7pgrdp5" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hwf-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/helpwithcourtfees.service.gov.uk/TXT/_dnsauth.staff"
        name                = "_dnsauth.staff"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "bs30d0zt8wy3hkn44nktj9j5pm5y972q" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ia-aip"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-immigration-asylum-decision.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.idam-user-dashboard"
        name                = "_dnsauth.idam-user-dashboard"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.idam-web-admin"
        name                = "_dnsauth.idam-web-admin"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-web-public"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts-access.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["lau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.log-and-audit"
        name                = "_dnsauth.log-and-audit"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["manage-payments"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-payments"
        name                = "_dnsauth.manage-payments"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["nfdiv-civil-partnership"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/end-civil-partnership.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ocmc"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/moneyclaims.service.gov.uk/TXT/_dnsauth.www1"
        name                = "_dnsauth.www1"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "8lck4v7jp0fj6404znjbss7zxctm18tm" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["paybubble"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.paybubble"
        name                = "_dnsauth.paybubble"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["payment-outcome"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.paymentoutcome-web"
        name                = "_dnsauth.paymentoutcome-web"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pcq"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.equality-and-diversity"
        name                = "_dnsauth.equality-and-diversity"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["plum"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.plum"
        name                = "_dnsauth.plum"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["private-law"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["probate"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-for-probate.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["reformscan"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.reformscan"
        name                = "_dnsauth.reformscan"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["return-case-doc-ccd"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.return-case-doc.ccd"
        name                = "_dnsauth.return-case-doc.ccd"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sptribs-frontend"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/special-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-cor"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk/TXT/_dnsauth.www.manage"
        name                = "_dnsauth.www.manage"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-tribunals"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-tya"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/track-benefit-appeal.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["tt-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-tax-tribunal.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "wtd9npx6z8s48v0vqt02bqbrq4c206k1" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-approve-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.administer-orgs"
        name                = "_dnsauth.administer-orgs"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-manage-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-org"
        name                = "_dnsauth.manage-org"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-register-org"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.register-org"
        name                = "_dnsauth.register-org"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["xui-webapp"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.manage-case"
        name                = "_dnsauth.manage-case"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 54 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1899,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->